MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAL169/mcu.h
extern volatile __U6RXRbits_t U6RXRbits __asm__ ("U6RXR") __attribute__((section("sfrs"), address(0xBF801490)));
#define U6CTSR U6CTSR
extern volatile uint32_t   U6CTSR __attribute__((section("sfrs"), address(0xBF801494)));
typedef struct {
  uint32_t U6CTSR:4;
} __U6CTSRbits_t;
extern volatile __U6CTSRbits_t U6CTSRbits __asm__ ("U6CTSR") __attribute__((section("sfrs"), address(0xBF801494)));
#define SDI1R SDI1R
extern volatile uint32_t   SDI1R __attribute__((section("sfrs"), address(0xBF80149C)));
typedef struct {
  uint32_t SDI1R:4;
} __SDI1Rbits_t;
extern volatile __SDI1Rbits_t SDI1Rbits __asm__ ("SDI1R") __attribute__((section("sfrs"), address(0xBF80149C)));
#define SS1R SS1R
extern volatile uint32_t   SS1R __attribute__((section("sfrs"), address(0xBF8014A0)));
typedef struct {
  uint32_t SS1R:4;
} __SS1Rbits_t;
extern volatile __SS1Rbits_t SS1Rbits __asm__ ("SS1R") __attribute__((section("sfrs"), address(0xBF8014A0)));
#define SDI2R SDI2R
extern volatile uint32_t   SDI2R __attribute__((section("sfrs"), address(0xBF8014A8)));
typedef struct {
  uint32_t SDI2R:4;
} __SDI2Rbits_t;
extern volatile __SDI2Rbits_t SDI2Rbits __asm__ ("SDI2R") __attribute__((section("sfrs"), address(0xBF8014A8)));
#define SS2R SS2R
extern volatile uint32_t   SS2R __attribute__((section("sfrs"), address(0xBF8014AC)));
typedef struct {
  uint32_t SS2R:4;
} __SS2Rbits_t;
extern volatile __SS2Rbits_t SS2Rbits __asm__ ("SS2R") __attribute__((section("sfrs"), address(0xBF8014AC)));
#define SDI3R SDI3R
extern volatile uint32_t   SDI3R __attribute__((section("sfrs"), address(0xBF8014B4)));
typedef struct {
  uint32_t SDI3R:4;
} __SDI3Rbits_t;
extern volatile __SDI3Rbits_t SDI3Rbits __asm__ ("SDI3R") __attribute__((section("sfrs"), address(0xBF8014B4)));
#define SS3R SS3R
extern volatile uint32_t   SS3R __attribute__((section("sfrs"), address(0xBF8014B8)));
typedef struct {
  uint32_t SS3R:4;
} __SS3Rbits_t;
extern volatile __SS3Rbits_t SS3Rbits __asm__ ("SS3R") __attribute__((section("sfrs"), address(0xBF8014B8)));
#define SDI4R SDI4R
extern volatile uint32_t   SDI4R __attribute__((section("sfrs"), address(0xBF8014C0)));
typedef struct {
  uint32_t SDI4R:4;
} __SDI4Rbits_t;
extern volatile __SDI4Rbits_t SDI4Rbits __asm__ ("SDI4R") __attribute__((section("sfrs"), address(0xBF8014C0)));
#define SS4R SS4R
extern volatile uint32_t   SS4R __attribute__((section("sfrs"), address(0xBF8014C4)));
typedef struct {
  uint32_t SS4R:4;
} __SS4Rbits_t;
extern volatile __SS4Rbits_t SS4Rbits __asm__ ("SS4R") __attribute__((section("sfrs"), address(0xBF8014C4)));
#define SDI5R SDI5R
extern volatile uint32_t   SDI5R __attribute__((section("sfrs"), address(0xBF8014CC)));
typedef struct {
  uint32_t SDI5R:4;
} __SDI5Rbits_t;
extern volatile __SDI5Rbits_t SDI5Rbits __asm__ ("SDI5R") __attribute__((section("sfrs"), address(0xBF8014CC)));
#define SS5R SS5R
extern volatile uint32_t   SS5R __attribute__((section("sfrs"), address(0xBF8014D0)));
typedef struct {
  uint32_t SS5R:4;
} __SS5Rbits_t;
extern volatile __SS5Rbits_t SS5Rbits __asm__ ("SS5R") __attribute__((section("sfrs"), address(0xBF8014D0)));
#define SDI6R SDI6R
extern volatile uint32_t   SDI6R __attribute__((section("sfrs"), address(0xBF8014D8)));
typedef struct {
  uint32_t SDI6R:4;
} __SDI6Rbits_t;
extern volatile __SDI6Rbits_t SDI6Rbits __asm__ ("SDI6R") __attribute__((section("sfrs"), address(0xBF8014D8)));
#define SS6R SS6R
extern volatile uint32_t   SS6R __attribute__((section("sfrs"), address(0xBF8014DC)));
typedef struct {
  uint32_t SS6R:4;
} __SS6Rbits_t;
extern volatile __SS6Rbits_t SS6Rbits __asm__ ("SS6R") __attribute__((section("sfrs"), address(0xBF8014DC)));
#define C1RXR C1RXR
extern volatile uint32_t   C1RXR __attribute__((section("sfrs"), address(0xBF8014E0)));
typedef struct {
  uint32_t C1RXR:4;
} __C1RXRbits_t;
extern volatile __C1RXRbits_t C1RXRbits __asm__ ("C1RXR") __attribute__((section("sfrs"), address(0xBF8014E0)));
#define C2RXR C2RXR
extern volatile uint32_t   C2RXR __attribute__((section("sfrs"), address(0xBF8014E4)));
typedef struct {
  uint32_t C2RXR:4;
} __C2RXRbits_t;
extern volatile __C2RXRbits_t C2RXRbits __asm__ ("C2RXR") __attribute__((section("sfrs"), address(0xBF8014E4)));
#define REFCLKI1R REFCLKI1R
extern volatile uint32_t   REFCLKI1R __attribute__((section("sfrs"), address(0xBF8014E8)));
typedef struct {
  uint32_t REFCLKI1R:4;
} __REFCLKI1Rbits_t;
extern volatile __REFCLKI1Rbits_t REFCLKI1Rbits __asm__ ("REFCLKI1R") __attribute__((section("sfrs"), address(0xBF8014E8)));
#define REFCLKI3R REFCLKI3R
extern volatile uint32_t   REFCLKI3R __attribute__((section("sfrs"), address(0xBF8014F0)));
typedef struct {
  uint32_t REFCLKI3R:4;
} __REFCLKI3Rbits_t;
extern volatile __REFCLKI3Rbits_t REFCLKI3Rbits __asm__ ("REFCLKI3R") __attribute__((section("sfrs"), address(0xBF8014F0)));
#define REFCLKI4R REFCLKI4R
extern volatile uint32_t   REFCLKI4R __attribute__((section("sfrs"), address(0xBF8014F4)));
typedef struct {
  uint32_t REFCLKI4R:4;
} __REFCLKI4Rbits_t;
extern volatile __REFCLKI4Rbits_t REFCLKI4Rbits __asm__ ("REFCLKI4R") __attribute__((section("sfrs"), address(0xBF8014F4)));
#define RPA14R RPA14R
extern volatile uint32_t   RPA14R __attribute__((section("sfrs"), address(0xBF801538)));
typedef struct {
  uint32_t RPA14R:4;
} __RPA14Rbits_t;
extern volatile __RPA14Rbits_t RPA14Rbits __asm__ ("RPA14R") __attribute__((section("sfrs"), address(0xBF801538)));
#define RPA15R RPA15R
extern volatile uint32_t   RPA15R __attribute__((section("sfrs"), address(0xBF80153C)));
typedef struct {
  uint32_t RPA15R:4;
} __RPA15Rbits_t;
extern volatile __RPA15Rbits_t RPA15Rbits __asm__ ("RPA15R") __attribute__((section("sfrs"), address(0xBF80153C)));
#define RPB0R RPB0R
extern volatile uint32_t   RPB0R __attribute__((section("sfrs"), address(0xBF801540)));
typedef struct {
  uint32_t RPB0R:4;
} __RPB0Rbits_t;
extern volatile __RPB0Rbits_t RPB0Rbits __asm__ ("RPB0R") __attribute__((section("sfrs"), address(0xBF801540)));
#define RPB1R RPB1R
extern volatile uint32_t   RPB1R __attribute__((section("sfrs"), address(0xBF801544)));
typedef struct {
  uint32_t RPB1R:4;
} __RPB1Rbits_t;
extern volatile __RPB1Rbits_t RPB1Rbits __asm__ ("RPB1R") __attribute__((section("sfrs"), address(0xBF801544)));
#define RPB2R RPB2R
extern volatile uint32_t   RPB2R __attribute__((section("sfrs"), address(0xBF801548)));
typedef struct {
  uint32_t RPB2R:4;
} __RPB2Rbits_t;
extern volatile __RPB2Rbits_t RPB2Rbits __asm__ ("RPB2R") __attribute__((section("sfrs"), address(0xBF801548)));
#define RPB3R RPB3R
extern volatile uint32_t   RPB3R __attribute__((section("sfrs"), address(0xBF80154C)));
typedef struct {
  uint32_t RPB3R:4;
} __RPB3Rbits_t;
extern volatile __RPB3Rbits_t RPB3Rbits __asm__ ("RPB3R") __attribute__((section("sfrs"), address(0xBF80154C)));
#define RPB5R RPB5R
extern volatile uint32_t   RPB5R __attribute__((section("sfrs"), address(0xBF801554)));
typedef struct {
  uint32_t RPB5R:4;
} __RPB5Rbits_t;
extern volatile __RPB5Rbits_t RPB5Rbits __asm__ ("RPB5R") __attribute__((section("sfrs"), address(0xBF801554)));
#define RPB6R RPB6R
extern volatile uint32_t   RPB6R __attribute__((section("sfrs"), address(0xBF801558)));
typedef struct {
  uint32_t RPB6R:4;
} __RPB6Rbits_t;
