MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAL169/mcu.h
extern volatile __ADCCMPEN6bits_t ADCCMPEN6bits __asm__ ("ADCCMPEN6") __attribute__((section("sfrs"), address(0xBF84B060)));
#define ADCCMP6 ADCCMP6
extern volatile uint32_t   ADCCMP6 __attribute__((section("sfrs"), address(0xBF84B064)));
typedef struct {
  uint32_t DCMPLO:16;
  uint32_t DCMPHI:16;
} __ADCCMP6bits_t;
extern volatile __ADCCMP6bits_t ADCCMP6bits __asm__ ("ADCCMP6") __attribute__((section("sfrs"), address(0xBF84B064)));
#define ADCFLTR1 ADCFLTR1
extern volatile uint32_t   ADCFLTR1 __attribute__((section("sfrs"), address(0xBF84B068)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:5;
  uint32_t :3;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t DFMODE:1;
  uint32_t DATA16EN:1;
  uint32_t AFEN:1;
} __ADCFLTR1bits_t;
extern volatile __ADCFLTR1bits_t ADCFLTR1bits __asm__ ("ADCFLTR1") __attribute__((section("sfrs"), address(0xBF84B068)));
#define ADCFLTR2 ADCFLTR2
extern volatile uint32_t   ADCFLTR2 __attribute__((section("sfrs"), address(0xBF84B06C)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:5;
  uint32_t :3;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t DFMODE:1;
  uint32_t DATA16EN:1;
  uint32_t AFEN:1;
} __ADCFLTR2bits_t;
extern volatile __ADCFLTR2bits_t ADCFLTR2bits __asm__ ("ADCFLTR2") __attribute__((section("sfrs"), address(0xBF84B06C)));
#define ADCFLTR3 ADCFLTR3
extern volatile uint32_t   ADCFLTR3 __attribute__((section("sfrs"), address(0xBF84B070)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:5;
  uint32_t :3;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t DFMODE:1;
  uint32_t DATA16EN:1;
  uint32_t AFEN:1;
} __ADCFLTR3bits_t;
extern volatile __ADCFLTR3bits_t ADCFLTR3bits __asm__ ("ADCFLTR3") __attribute__((section("sfrs"), address(0xBF84B070)));
#define ADCFLTR4 ADCFLTR4
extern volatile uint32_t   ADCFLTR4 __attribute__((section("sfrs"), address(0xBF84B074)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:5;
  uint32_t :3;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t DFMODE:1;
  uint32_t DATA16EN:1;
  uint32_t AFEN:1;
} __ADCFLTR4bits_t;
extern volatile __ADCFLTR4bits_t ADCFLTR4bits __asm__ ("ADCFLTR4") __attribute__((section("sfrs"), address(0xBF84B074)));
#define ADCFLTR5 ADCFLTR5
extern volatile uint32_t   ADCFLTR5 __attribute__((section("sfrs"), address(0xBF84B078)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:5;
  uint32_t :3;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t DFMODE:1;
  uint32_t DATA16EN:1;
  uint32_t AFEN:1;
} __ADCFLTR5bits_t;
extern volatile __ADCFLTR5bits_t ADCFLTR5bits __asm__ ("ADCFLTR5") __attribute__((section("sfrs"), address(0xBF84B078)));
#define ADCFLTR6 ADCFLTR6
extern volatile uint32_t   ADCFLTR6 __attribute__((section("sfrs"), address(0xBF84B07C)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:5;
  uint32_t :3;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t DFMODE:1;
  uint32_t DATA16EN:1;
  uint32_t AFEN:1;
} __ADCFLTR6bits_t;
extern volatile __ADCFLTR6bits_t ADCFLTR6bits __asm__ ("ADCFLTR6") __attribute__((section("sfrs"), address(0xBF84B07C)));
#define ADCTRG1 ADCTRG1
extern volatile uint32_t   ADCTRG1 __attribute__((section("sfrs"), address(0xBF84B080)));
typedef struct {
  uint32_t TRGSRC0:5;
  uint32_t :3;
  uint32_t TRGSRC1:5;
  uint32_t :3;
  uint32_t TRGSRC2:5;
  uint32_t :3;
  uint32_t TRGSRC3:5;
} __ADCTRG1bits_t;
extern volatile __ADCTRG1bits_t ADCTRG1bits __asm__ ("ADCTRG1") __attribute__((section("sfrs"), address(0xBF84B080)));
#define ADCTRG2 ADCTRG2
extern volatile uint32_t   ADCTRG2 __attribute__((section("sfrs"), address(0xBF84B084)));
typedef struct {
  uint32_t TRGSRC4:5;
  uint32_t :3;
  uint32_t TRGSRC5:5;
  uint32_t :3;
  uint32_t TRGSRC6:5;
  uint32_t :3;
  uint32_t TRGSRC7:5;
} __ADCTRG2bits_t;
extern volatile __ADCTRG2bits_t ADCTRG2bits __asm__ ("ADCTRG2") __attribute__((section("sfrs"), address(0xBF84B084)));
#define ADCTRG3 ADCTRG3
extern volatile uint32_t   ADCTRG3 __attribute__((section("sfrs"), address(0xBF84B088)));
typedef struct {
  uint32_t TRGSRC8:5;
  uint32_t :3;
  uint32_t TRGSRC9:5;
  uint32_t :3;
  uint32_t TRGSRC10:5;
  uint32_t :3;
  uint32_t TRGSRC11:5;
} __ADCTRG3bits_t;
extern volatile __ADCTRG3bits_t ADCTRG3bits __asm__ ("ADCTRG3") __attribute__((section("sfrs"), address(0xBF84B088)));
#define ADCCMPCON1 ADCCMPCON1
extern volatile uint32_t   ADCCMPCON1 __attribute__((section("sfrs"), address(0xBF84B0A0)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:6;
  uint32_t :2;
  uint32_t CVDDATA:16;
} __ADCCMPCON1bits_t;
extern volatile __ADCCMPCON1bits_t ADCCMPCON1bits __asm__ ("ADCCMPCON1") __attribute__((section("sfrs"), address(0xBF84B0A0)));
#define ADCCMPCON2 ADCCMPCON2
extern volatile uint32_t   ADCCMPCON2 __attribute__((section("sfrs"), address(0xBF84B0A4)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __ADCCMPCON2bits_t;
extern volatile __ADCCMPCON2bits_t ADCCMPCON2bits __asm__ ("ADCCMPCON2") __attribute__((section("sfrs"), address(0xBF84B0A4)));
#define ADCCMPCON3 ADCCMPCON3
extern volatile uint32_t   ADCCMPCON3 __attribute__((section("sfrs"), address(0xBF84B0A8)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __ADCCMPCON3bits_t;
extern volatile __ADCCMPCON3bits_t ADCCMPCON3bits __asm__ ("ADCCMPCON3") __attribute__((section("sfrs"), address(0xBF84B0A8)));
#define ADCCMPCON4 ADCCMPCON4
extern volatile uint32_t   ADCCMPCON4 __attribute__((section("sfrs"), address(0xBF84B0AC)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __ADCCMPCON4bits_t;
extern volatile __ADCCMPCON4bits_t ADCCMPCON4bits __asm__ ("ADCCMPCON4") __attribute__((section("sfrs"), address(0xBF84B0AC)));
#define ADCCMPCON5 ADCCMPCON5
extern volatile uint32_t   ADCCMPCON5 __attribute__((section("sfrs"), address(0xBF84B0B0)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __ADCCMPCON5bits_t;
