MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAL169/mcu.h
extern volatile __C2FIFOINT22bits_t C2FIFOINT22bits __asm__ ("C2FIFOINT22") __attribute__((section("sfrs"), address(0xBF8818E0)));
extern volatile uint32_t        C2FIFOINT22CLR __attribute__((section("sfrs"),address(0xBF8818E4)));
extern volatile uint32_t        C2FIFOINT22SET __attribute__((section("sfrs"),address(0xBF8818E8)));
extern volatile uint32_t        C2FIFOINT22INV __attribute__((section("sfrs"),address(0xBF8818EC)));
#define C2FIFOUA22 C2FIFOUA22
extern volatile uint32_t   C2FIFOUA22 __attribute__((section("sfrs"), address(0xBF8818F0)));
extern volatile uint32_t        C2FIFOUA22CLR __attribute__((section("sfrs"),address(0xBF8818F4)));
extern volatile uint32_t        C2FIFOUA22SET __attribute__((section("sfrs"),address(0xBF8818F8)));
extern volatile uint32_t        C2FIFOUA22INV __attribute__((section("sfrs"),address(0xBF8818FC)));
#define C2FIFOCI22 C2FIFOCI22
extern volatile uint32_t   C2FIFOCI22 __attribute__((section("sfrs"), address(0xBF881900)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI22bits_t;
extern volatile __C2FIFOCI22bits_t C2FIFOCI22bits __asm__ ("C2FIFOCI22") __attribute__((section("sfrs"), address(0xBF881900)));
extern volatile uint32_t        C2FIFOCI22CLR __attribute__((section("sfrs"),address(0xBF881904)));
extern volatile uint32_t        C2FIFOCI22SET __attribute__((section("sfrs"),address(0xBF881908)));
extern volatile uint32_t        C2FIFOCI22INV __attribute__((section("sfrs"),address(0xBF88190C)));
#define C2FIFOCON23 C2FIFOCON23
extern volatile uint32_t   C2FIFOCON23 __attribute__((section("sfrs"), address(0xBF881910)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON23bits_t;
extern volatile __C2FIFOCON23bits_t C2FIFOCON23bits __asm__ ("C2FIFOCON23") __attribute__((section("sfrs"), address(0xBF881910)));
extern volatile uint32_t        C2FIFOCON23CLR __attribute__((section("sfrs"),address(0xBF881914)));
extern volatile uint32_t        C2FIFOCON23SET __attribute__((section("sfrs"),address(0xBF881918)));
extern volatile uint32_t        C2FIFOCON23INV __attribute__((section("sfrs"),address(0xBF88191C)));
#define C2FIFOINT23 C2FIFOINT23
extern volatile uint32_t   C2FIFOINT23 __attribute__((section("sfrs"), address(0xBF881920)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT23bits_t;
extern volatile __C2FIFOINT23bits_t C2FIFOINT23bits __asm__ ("C2FIFOINT23") __attribute__((section("sfrs"), address(0xBF881920)));
extern volatile uint32_t        C2FIFOINT23CLR __attribute__((section("sfrs"),address(0xBF881924)));
extern volatile uint32_t        C2FIFOINT23SET __attribute__((section("sfrs"),address(0xBF881928)));
extern volatile uint32_t        C2FIFOINT23INV __attribute__((section("sfrs"),address(0xBF88192C)));
#define C2FIFOUA23 C2FIFOUA23
extern volatile uint32_t   C2FIFOUA23 __attribute__((section("sfrs"), address(0xBF881930)));
extern volatile uint32_t        C2FIFOUA23CLR __attribute__((section("sfrs"),address(0xBF881934)));
extern volatile uint32_t        C2FIFOUA23SET __attribute__((section("sfrs"),address(0xBF881938)));
extern volatile uint32_t        C2FIFOUA23INV __attribute__((section("sfrs"),address(0xBF88193C)));
#define C2FIFOCI23 C2FIFOCI23
extern volatile uint32_t   C2FIFOCI23 __attribute__((section("sfrs"), address(0xBF881940)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI23bits_t;
extern volatile __C2FIFOCI23bits_t C2FIFOCI23bits __asm__ ("C2FIFOCI23") __attribute__((section("sfrs"), address(0xBF881940)));
extern volatile uint32_t        C2FIFOCI23CLR __attribute__((section("sfrs"),address(0xBF881944)));
extern volatile uint32_t        C2FIFOCI23SET __attribute__((section("sfrs"),address(0xBF881948)));
extern volatile uint32_t        C2FIFOCI23INV __attribute__((section("sfrs"),address(0xBF88194C)));
#define C2FIFOCON24 C2FIFOCON24
extern volatile uint32_t   C2FIFOCON24 __attribute__((section("sfrs"), address(0xBF881950)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON24bits_t;
extern volatile __C2FIFOCON24bits_t C2FIFOCON24bits __asm__ ("C2FIFOCON24") __attribute__((section("sfrs"), address(0xBF881950)));
extern volatile uint32_t        C2FIFOCON24CLR __attribute__((section("sfrs"),address(0xBF881954)));
extern volatile uint32_t        C2FIFOCON24SET __attribute__((section("sfrs"),address(0xBF881958)));
extern volatile uint32_t        C2FIFOCON24INV __attribute__((section("sfrs"),address(0xBF88195C)));
#define C2FIFOINT24 C2FIFOINT24
extern volatile uint32_t   C2FIFOINT24 __attribute__((section("sfrs"), address(0xBF881960)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT24bits_t;
extern volatile __C2FIFOINT24bits_t C2FIFOINT24bits __asm__ ("C2FIFOINT24") __attribute__((section("sfrs"), address(0xBF881960)));
extern volatile uint32_t        C2FIFOINT24CLR __attribute__((section("sfrs"),address(0xBF881964)));
extern volatile uint32_t        C2FIFOINT24SET __attribute__((section("sfrs"),address(0xBF881968)));
extern volatile uint32_t        C2FIFOINT24INV __attribute__((section("sfrs"),address(0xBF88196C)));
#define C2FIFOUA24 C2FIFOUA24
extern volatile uint32_t   C2FIFOUA24 __attribute__((section("sfrs"), address(0xBF881970)));
extern volatile uint32_t        C2FIFOUA24CLR __attribute__((section("sfrs"),address(0xBF881974)));
extern volatile uint32_t        C2FIFOUA24SET __attribute__((section("sfrs"),address(0xBF881978)));
extern volatile uint32_t        C2FIFOUA24INV __attribute__((section("sfrs"),address(0xBF88197C)));
#define C2FIFOCI24 C2FIFOCI24
extern volatile uint32_t   C2FIFOCI24 __attribute__((section("sfrs"), address(0xBF881980)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI24bits_t;
